# ------------------------------------------------------------------------------
# Core
# ------------------------------------------------------------------------------
brew 'stow'         # Organize software neatly under a single directory tree
brew 'tmux'         # My choice of terminal multiplexer
brew 'lsd'
brew 'entr'         # Run command on filechange
brew 'starship'     # The cross-shell prompt for astronauts; https://starship.rs
brew 'neovim'       # , args: %w[HEAD]
brew 'mobile-shell' # Mobile Shell (MOSH) is like SSH plus roaming and smart echo.
brew 'bat'          # Clone of cat(1) with syntax highlighting and Git integration
brew 'git'
brew 'lazygit'
brew 'ctags'
brew 'tree'
brew 'fzf'
brew 'zoxide'
brew 'ag'
brew 'ripgrep'
brew 'jq'
brew 'yq'
brew 'rsync'
cask 'gpg-suite'
brew 'htop'
brew 'httpie'
brew 'imagemagick@6', link: true
brew 'yazi'
brew 'gh'
tap 'olets/tap'
brew 'olets/tap/zsh-abbr'

brew 'llm'  # Access to multiple LLMs from the terminal with logging and more...
brew 'glow' # Markdown rendering in the terminal

# ------------------------------------------------------------------------------
# Languages
# ------------------------------------------------------------------------------
brew 'bash-language-server'
brew 'bats'
brew 'chruby'
brew 'go'
brew 'lua-language-server'
brew 'node'
brew 'ruby-install'
brew 'shellcheck'
brew 'yarn'

# ------------------------------------------------------------------------------
# Apps for work
# ------------------------------------------------------------------------------
# tap 'derailed/k9s'
# brew 'k9s'
# cask 'google-cloud-sdk'
# cask 'slack'
# cask 'google-chrome'
cask 'kitty'
cask 'rectangle'
# mas 'Jira Cloud by Atlassian', id: 1475897096

# ------------------------------------------------------------------------------
# Apps for personal and productivity use
# ------------------------------------------------------------------------------
# cask 'obsidian'
# cask 'raycast'
# cask 'launchbar'
# cask 'choosy'
# mas 'Things 3', id: 904280696

# ------------------------------------------------------------------------------
# Fonts
# ------------------------------------------------------------------------------
cask 'font-victor-mono-nerd-font'
