# ------------------------------------------------------------------------------
# Core
# ------------------------------------------------------------------------------
brew 'stow'         # Organize software neatly under a single directory tree
brew 'tmux'         # My choice of terminal multiplexer
# brew 'fish'         # Shell for the win
brew 'lsd'
brew 'starship'     # The cross-shell prompt for astronauts; https://starship.rs
brew 'neovim', args: %w[HEAD]
brew 'mobile-shell' # Mobile Shell (MOSH) is like SSH plus roaming and smart echo.
brew 'bat'          # Clone of cat(1) with syntax highlighting and Git integration
brew 'git'
brew 'svn'
brew 'tig'
brew 'hub'
brew 'ctags'
brew 'tree'
brew 'fzf'
brew 'ag'
brew 'jq'
brew 'yq'
brew 'rsync'
cask 'gpg-suite'
brew 'htop'
brew 'httpie'
brew 'imagemagick@6', link: true
brew 'ranger'
brew 'gh'
brew 'kubectx'
brew 'helm'
brew 'olets/tap/zsh-abbr'

# ------------------------------------------------------------------------------
# Languages
# ------------------------------------------------------------------------------
brew 'go'
brew 'node'
brew 'yarn'
brew 'chruby'
brew 'chruby-fish'
brew 'ruby-install'
# brew 'shellcheck'
brew 'bats'

# ------------------------------------------------------------------------------
# HashiCorp
# ------------------------------------------------------------------------------
# tap 'hashicorp/tap'
# brew 'hashicorp/tap/terraform-ls'
# brew 'vault'

# ------------------------------------------------------------------------------
# Apps for work
# ------------------------------------------------------------------------------
brew 'derailed/k9s/k9s'
cask 'google-cloud-sdk'
# cask 'slack'
# cask 'google-chrome'
# cask 'viscosity'
# cask 'docker'
cask 'alacritty'
cask 'sequel-pro'
cask 'rectangle'
# mas 'Jira Cloud by Atlassian', id: 1475897096

# ------------------------------------------------------------------------------
# Apps for personal and productivity use
# ------------------------------------------------------------------------------
cask 'launchbar'
cask 'choosy'
mas 'Things 3', id: 904280696
mas '1Password', id: 443987910 # 1Password 6.x
mas 'Telegram', id: 747648890
# mas 'Messenger', id: 1480068668

# ------------------------------------------------------------------------------
# Fonts
# ------------------------------------------------------------------------------
tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-roboto-mono'
